uhnp/src/Documents/ЗаявкаНаКорректировкуПланов/ЗаявкаНаКорректировкуПланов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаКорректировкуПланов</name>
  <registerRecords>AccumulationRegister.ОперацииБюджетов</registerRecords>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОбъектыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.ДоговорКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Планы</name>
    <attributes>
      <name>НачалоПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.Периодичность</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>DefinedType.Организация</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>DefinedType.ЦФО</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриходРасход</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>Characteristic.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектКонтроля</name>
      <type>
        <types>Characteristic.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика6</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРезерв</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРезерва</name>
      <type>
        <types>DefinedType.ОбъектыПланирования</types>
      </type>
    </attributes>
    <attributes>
      <name>Свободно</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Documents/ЗаявкаНаКорректировкуПланов/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства	  
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
   
	Если Параметры.Ключ.Пустая() Тогда  	
		Если Параметры.Свойство("ДанныеЗаполнения") 
			И Параметры.ДанныеЗаполнения.Свойство("ВидБюджета") Тогда
			
			Объект.ВидБюджета = Параметры.ДанныеЗаполнения.ВидБюджета;
			
			ЗаполнитьПоДокументуПланированияНаСервере();   
			
			Если Объект.Планы.Количество() = 0 Тогда
				ВызватьИсключение НСтр("ru = 'Данные для корректировки планов и лимитов отсутствуют '");	
			КонецЕсли;  
			
		КонецЕсли;
		
		ПриЧтенииСозданииНаСервере();
		Модифицированность = Истина;
	КонецЕсли;
	
	#Область УХ_Согласование
	ДействияСогласованиеУХСервер.НарисоватьПанельСогласованияИОпределитьСостояниеОбъекта(ЭтаФорма, Элементы.ГруппаНомерДата);
	#КонецОбласти
	
	Если Элементы.Страницы.ТолькоПросмотр Тогда
		// Разблокировать таблицу корректировок
		Элементы.Страницы.ТолькоПросмотр = Ложь;
		Элементы.СтраницаПланы.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	УправлениеФормой();
	
	УстановитьОграничениеТипаДокументаОснования();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства	
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства	
	
	Если Параметры.Ключ.Пустая() Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
	Если Не Объект.Проведен Тогда
		ПриОжиданииВыполнитьКонтрольДокумента();   
	КонецЕсли;	

	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		УправлениеФормой();  
	КонецЕсли;   
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	АналитикиСтатейБюджетовУХ.ЗаполнитьРеквизитыАналитикВсехСтатей(ЭтотОбъект);
	УстановитьСостояниеДокумента();
	ОбновитьПредставлениеПериодовПланирования();
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
    	ОбновитьЭлементыДополнительныхРеквизитов();
	    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства	
	
	#Область УХ_Согласование
	Если ИмяСобытия = "ОбъектСогласован" Тогда
		ОпределитьСостояниеОбъекта();
	ИначеЕсли ИмяСобытия = "ОбъектОтклонен" Тогда
		ОпределитьСостояниеОбъекта();
	ИначеЕсли ИмяСобытия = "МаршрутИнициализирован" Тогда
		ОпределитьСостояниеОбъекта();
	ИначеЕсли ИмяСобытия = "СостояниеЗаявкиПриИзменении" Тогда
		ОпределитьСостояниеОбъекта();
	КонецЕсли;
	#КонецОбласти  
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	ЗаполнитьПоДокументуПланированияНаСервере();
КонецПроцедуры   

&НаКлиенте
Процедура ВидБюджетаПриИзменении(Элемент)
	
	Модифицированность = Истина;

КонецПроцедуры 

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, 
		ЭтотОбъект, 
		"Объект.Комментарий");
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СтатьяБюджета_ПриИзменении(Элемент)
	АналитикиСтатейБюджетовУХКлиент.ПриИзмененииСтатьиБюджета(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаСтатьиБюджета_ПриИзменении(Элемент)
	
	АналитикиСтатейБюджетовУХКлиент.ПриИзмененииАналитикиСтатьиБюджета(ЭтотОбъект, Элемент.Имя); 
	
	СтрокаТабличнойЧасти = Элементы.Требуется.ТекущиеДанные;
	ОбновитьСвободныйОстаток(СтрокаТабличнойЧасти);

КонецПроцедуры

#Область ОбработчикиСобытийЕдиныеПараметры

&НаКлиенте
Процедура ЕдиныйПериодПриИзменении(Элемент)
	
	Модифицированность = Истина;
	КонтрольЛимитовФормыКлиент.СохранитьВосстановитьЕдиноеЗначение(ЭтаФорма, ЕдиныйПериод, "НачалоПериода");
	КонтрольЛимитовФормыКлиент.СохранитьВосстановитьЕдиноеЗначение(ЭтаФорма, ЕдиныйПериод, "Периодичность");
	КонтрольЛимитовФормыКлиент.СохранитьВосстановитьЕдиноеЗначение(ЭтаФорма, ЕдиныйПериод, "ПредставлениеПериода");
	
	ПриИзмененииЕдиногоРеквизита("ЕдиныйПериод");
	ОбновитьПредставлениеПериодовПланирования();
	КонтрольЛимитовФормыКлиентСервер.НастроитьЗависимыеЭлементыФормы(ЭтаФорма, Элемент.Имя);  
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДополнительныеПараметры = Новый Структура("НачалоПериода", НачалоПериода);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВвестиДатуЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВводДаты(ОписаниеОповещения, НачалоПериода, "Введите дату");
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиДатуЗавершение(Дата, ДополнительныеПараметры) Экспорт
	
	НачалоПериода = ?(Дата = Неопределено, ДополнительныеПараметры.НачалоПериода, Дата);
	
	Если ЗначениеЗаполнено(НачалоПериода) Тогда
		НачалоПериодаПриИзменении();
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура НачалоПериодаПриИзменении()
	
	Модифицированность = Истина;
	
	Периодичность = ПолучитьПериодичностьПланирования(Объект.ВидБюджета, НачалоПериода);
	
	ПредставлениеПериода = ОбщегоНазначенияОПККлиентСервер.ПредставлениеПериодаПоПериодичности(
		НачалоПериода, Периодичность);
		
	НачалоПериода = КэшируемыеПроцедурыУХ.ДатаНачалаПериода(НачалоПериода, Периодичность);
		
	КонтрольЛимитовФормыКлиент.ПроверкаОчисткиЕдиногоРеквизита(ЭтаФорма, "ЕдиныйПериод", "НачалоПериода");
	ПриИзмененииЕдиногоРеквизита("ЕдиныйПериод");
		
КонецПроцедуры

&НаКлиенте
Процедура ЕдиныйЦФОПриИзменении(Элемент)
	
	Модифицированность = Истина;
	КонтрольЛимитовФормыКлиент.СохранитьВосстановитьЕдиноеЗначение(ЭтаФорма, ЕдиныйЦФО, "ЦФО");
	ПриИзмененииЕдиногоРеквизита("ЕдиныйЦФО");
	КонтрольЛимитовФормыКлиентСервер.НастроитьЗависимыеЭлементыФормы(ЭтаФорма, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦФОПриИзменении(Элемент)
	
	Модифицированность = Истина;
	КонтрольЛимитовФормыКлиент.ПроверкаОчисткиЕдиногоРеквизита(ЭтаФорма, "ЕдиныйЦФО", "ЦФО");
	ПриИзмененииЕдиногоРеквизита("ЕдиныйЦФО");

КонецПроцедуры

&НаКлиенте
Процедура ЕдиныйПроектПриИзменении(Элемент)
	
	Модифицированность = Истина;
	КонтрольЛимитовФормыКлиент.СохранитьВосстановитьЕдиноеЗначение(ЭтаФорма, ЕдиныйПроект, "Проект");
	ПриИзмененииЕдиногоРеквизита("ЕдиныйПроект");
	КонтрольЛимитовФормыКлиентСервер.НастроитьЗависимыеЭлементыФормы(ЭтаФорма, Элемент.Имя);

КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	Модифицированность = Истина;
	КонтрольЛимитовФормыКлиент.ПроверкаОчисткиЕдиногоРеквизита(ЭтаФорма, "ЕдиныйПроект", "Проект");
	ПриИзмененииЕдиногоРеквизита("ЕдиныйПроект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдинаяВалютаПриИзменении(Элемент)
	
	Модифицированность = Истина;
	КонтрольЛимитовФормыКлиент.СохранитьВосстановитьЕдиноеЗначение(ЭтаФорма, ЕдинаяВалюта, "Валюта");
	ПриИзмененииЕдиногоРеквизита("ЕдинаяВалюта");
	КонтрольЛимитовФормыКлиентСервер.НастроитьЗависимыеЭлементыФормы(ЭтаФорма, Элемент.Имя);

КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	Модифицированность = Истина;
	КонтрольЛимитовФормыКлиент.ПроверкаОчисткиЕдиногоРеквизита(ЭтаФорма, "ЕдинаяВалюта", "Валюта");
	ПриИзмененииЕдиногоРеквизита("ЕдинаяВалюта");
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиныйПриходРасходПриИзменении(Элемент)
	
	Модифицированность = Истина;
	КонтрольЛимитовФормыКлиент.СохранитьВосстановитьЕдиноеЗначение(ЭтаФорма, ЕдиныйПриходРасход, "ПриходРасход");
	ПриИзмененииЕдиногоРеквизита("ЕдиныйПриходРасход");
	КонтрольЛимитовФормыКлиентСервер.НастроитьЗависимыеЭлементыФормы(ЭтаФорма, Элемент.Имя);

КонецПроцедуры

&НаКлиенте
Процедура ПриходРасходПриИзменении(Элемент)
	
	Модифицированность = Истина;
	КонтрольЛимитовФормыКлиент.ПроверкаОчисткиЕдиногоРеквизита(ЭтаФорма, "ЕдиныйПриходРасход", "ПриходРасход");
	ПриИзмененииЕдиногоРеквизита("ЕдиныйПриходРасход");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПланы

&НаКлиенте
Процедура ПланыПриИзменении(Элемент)
	
	ПриОжиданииВыполнитьКонтрольДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПланыПередНачаломИзменения(Элемент, Отказ)
	АналитикиСтатейБюджетовУХКлиент.ПередНачаломИзмененияСтрокиТаблицыФормы(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПланыСтатьяБюджетаПриИзменении(Элемент)
	
	АналитикиСтатейБюджетовУХКлиент.ПриИзмененииСтатьиБюджета(ЭтотОбъект, Элемент.Имя);
	СтрокаТабличнойЧасти = Элементы.Планы.ТекущиеДанные;
	ОбновитьСвободныйОстаток(СтрокаТабличнойЧасти);   
	
КонецПроцедуры

&НаКлиенте
Процедура ПланыДатаОперацииПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Планы.ТекущиеДанные;
	
	ОбновитьПредставлениеПериодаСтроки(ТекущиеДанные, Объект.ВидБюджета);
	
	ТекущиеДанные.НачалоПериода = КэшируемыеПроцедурыУХ.ДатаНачалаПериода(
						ТекущиеДанные.НачалоПериода, ТекущиеДанные.Периодичность);
						
	ОбновитьСвободныйОстаток(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Отказ = Истина;	     
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПланыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Реквизиты = Новый Массив;
		
		Если ЕдиныйПериод Тогда
			Реквизиты.Добавить("НачалоПериода"); 
			Реквизиты.Добавить("Периодичность");
		КонецЕсли;
		
		Если ЕдиныйЦФО Тогда
			Реквизиты.Добавить("ЦФО");
		КонецЕсли;  
		
		Если ЕдиныйПроект Тогда
			Реквизиты.Добавить("Проект");
		КонецЕсли;
		
		Если ЕдинаяВалюта Тогда
			Реквизиты.Добавить("Валюта");
		КонецЕсли;
		
		Если ЕдиныйПриходРасход Тогда
			Реквизиты.Добавить("ПриходРасход");
		КонецЕсли;
				
		ИменаРеквизитов = СтрСоединить(Реквизиты, ",");
		ЗаполнитьЗначенияСвойств(Элемент.ТекущиеДанные, ЭтотОбъект, ИменаРеквизитов);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПланыЦФОПриИзменении(Элемент) 
	
	СтрокаТабличнойЧасти = Элементы.Планы.ТекущиеДанные;
	ОбновитьСвободныйОстаток(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланыПроектПриИзменении(Элемент) 
	
	СтрокаТабличнойЧасти = Элементы.Планы.ТекущиеДанные;
	ОбновитьСвободныйОстаток(СтрокаТабличнойЧасти); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПланыВалютаПриИзменении(Элемент) 
	
	СтрокаТабличнойЧасти = Элементы.Планы.ТекущиеДанные;
	ОбновитьСвободныйОстаток(СтрокаТабличнойЧасти);
	
КонецПроцедуры

#КонецОбласти                                       

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоОснованию(Команда)
	
	Если Объект.Проведен Тогда      	
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьПоОснованиюЗавершение", ЭтотОбъект);
		
		ТекстВопроса = НСтр("ru = 'Операция в проведенном документе запрещена. Отменить проведение?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);  		
	Иначе     	
		ЗаполнитьПоДокументуПланированияНаСервере();		
	КонецЕсли;	

КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьПоОснованиюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьПоДокументуПланированияНаСервере();

КонецПроцедуры   

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, 
					НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
    УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти  

#Область ВызовыОбщихПроцедурИФункцийСогласованияОбъектов

&НаСервере
Процедура ОпределитьСостояниеОбъекта(ОбновитьОтветственныхВход = Ложь)
	ДействияСогласованиеУХСервер.ОпределитьСостояниеЗаявки(ЭтаФорма, ОбновитьОтветственныхВход);
КонецПроцедуры

&НаКлиенте
Процедура СтатусОбъектаПриИзменении_Подключаемый()
	НовоеЗначениеСтатуса = РеквизитСтатусОбъекта(ЭтаФорма);
	ПроверитьСохранениеИзменитьСтатус(НовоеЗначениеСтатуса);	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение = РеквизитСтатусОбъекта(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьСохранениеИзменитьСтатус(ВыбранноеЗначение);
КонецПроцедуры

// Проверяет сохранение текущего объекта и изменяет его статус
// НовоеЗначениеСтатусаВход.
&НаКлиенте
Процедура ПроверитьСохранениеИзменитьСтатус(НовоеЗначениеСтатусаВход)
	
	Если (Объект.Ссылка.Пустая()) 
		Или (ЭтаФорма.Модифицированность) Тогда
		
		СтруктураПараметров = Новый Структура("ВыбранноеЗначение", НовоеЗначениеСтатусаВход);
		ОписаниеОповещения = Новый ОписаниеОповещения("СостояниеЗаявкиОбработкаВыбораПродолжение", 
							ЭтотОбъект, СтруктураПараметров);     
							
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
		|Изменение состояния возможно только после записи данных.
		|Данные будут записаны.'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
		Возврат;  
		
	КонецЕсли;
	
	ИзменитьСостояниеЗаявкиКлиент(НовоеЗначениеСтатусаВход);
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЗаявкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение = РеквизитСостояниеЗаявки(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;

	ПроверитьСохранениеИзменитьСтатус(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение)
	ДействияСогласованиеУХКлиент.ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЗаявкиОбработкаВыбораПродолжение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Записать();
		ИзменитьСостояниеЗаявкиКлиент(Параметры.ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИзменитьСостояниеЗаявки(Ссылка, Состояние)
	Возврат УправлениеПроцессамиСогласованияУХ.ПеревестиЗаявкуВПроизвольноеСостояние(Ссылка, Состояние, , , ЭтаФорма);
КонецФункции

// Возвращает значение реквизита СостояниеЗаявки на форме ФормаВход.
// Т.к. данный реквизит генерируется кодом, обращение к нему напрямую из
// кода недоступно.
&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСостояниеЗаявки(ФормаВход)
	Возврат ФормаВход["СостояниеЗаявки"];
КонецФункции

// Возвращает значение реквизита СтатусОбъекта на форме ФормаВход.
// Т.к. данный реквизит генерируется кодом, обращение к нему напрямую из
// кода недоступно.
&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСтатусОбъекта(ФормаВход)
	Возврат ФормаВход["СтатусОбъекта"];
КонецФункции

// Возвращает значение реквизита Согласующий на форме ФормаВход.
// Т.к. данный реквизит генерируется кодом, обращение к нему напрямую из
// кода недоступно.
&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСогласующий(ФормаВход)
	Возврат ФормаВход["Согласующий"];
КонецФункции

&НаКлиенте
Процедура ПринятьКСогласованию_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ПринятьКСогласованию(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСогласования_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ИсторияСогласования(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СогласоватьДокумент_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.СогласоватьДокумент(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьСогласование_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ОтменитьСогласование(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура МаршрутСогласования_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.МаршрутСогласования(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ВложенияСогласования_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ТелеграмВложенныеФайлы(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры
 
// Выполняет обработчик ПриИзменении, сопоставленный по умолчанию для элемента Элемент
&НаКлиенте
Процедура ВыполнитьПредыдущийОбработчикПриИзмененииОрганизации(Элемент)

	#Если НЕ ВебКлиент Тогда
		ИмяЭлемента = Элемент.Имя;
		Если ЗначениеЗаполнено(ИмяЭлемента) Тогда
			Для Каждого ТекОбработчикиИзмененияОрганизации Из ЭтаФорма["ОбработчикиИзмененияОрганизации"] Цикл
				Если СокрЛП(ТекОбработчикиИзмененияОрганизации.ИмяРеквизита) = СокрЛП(ИмяЭлемента) Тогда
					СтрокаВыполнения = ТекОбработчикиИзмененияОрганизации.ИмяОбработчика + "(Элемент);";
					Выполнить СтрокаВыполнения;
				КонецЕсли; 
			КонецЦикла;	
		КонецЕсли;
	#КонецЕсли  

КонецПроцедуры // ВыполнитьПредыдущийОбработчикПриИзмененииОрганизации()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	#Область ПериодыПланирования
	
    // Планы 
	ЭлементУО = ЭтотОбъект.УсловноеОформление.Элементы.Добавить();
	ФормыУХ.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ПланыНачалоПериода.Имя);
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Планы.НачалоПериода");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", 
		Новый ПолеКомпоновкиДанных("Объект.Планы.ПредставлениеПериода"));
	
	#КонецОбласти  
	
	// Лимит, Резерв
	ЭлементУО = УсловноеОформление.Элементы.Добавить();	    
	
	ФормыУХ.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПланыСумма");
	ФормыУХ.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПланыСуммаРезерв");
	
	ГруппаОтбора = ФормыУХ.НоваяГруппаИ(ЭлементУО.Отбор);
	
	ФормыУХ.НовыйОтбор(ГруппаОтбора, "Объект.Планы.Сумма", , , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ФормыУХ.НовыйОтбор(ГруппаОтбора, "Объект.Планы.СуммаРезерв", , , ВидСравненияКомпоновкиДанных.НеЗаполнено);    
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);    
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	//
	УстановитьСостояниеДокумента();

	// Данные для создания полей Аналитика* для элементов Статьи бюджетов
	АСБ = АналитикиСтатейБюджетовУХ;
	
	МассивОписанийСтатей = Новый Массив;
	АналитикиСтатейБюджетовУХ.СтатьяИАналитикиТабличнойЧастиВТаблицеФормы(МассивОписанийСтатей, 
		"Планы",  "Планы",
		"СтатьяБюджета", "ПланыСтатьяБюджета",
		"Аналитика%1", "ПланыАналитика%1",
		ФормыУХ.РазместитьВГруппе("ПланыГруппаАналитикаСтатейБюджета"));
	
	// Создать элементы формы для статей бюджетов и их аналитик
	АналитикиСтатейБюджетовУХ.СоздатьСтатьиБюджетовИАналитики(ЭтотОбъект, МассивОписанийСтатей);

	// Управление элементами формы 
	УправлениеЭлементамиФормы.ПриЧтенииСозданииНаСервере(ЭтотОбъект);
	
	КонтрольЛимитовФормы.ДобавитьЗависимостьПолей(ЭтаФорма, "ЕдиныйПериод", "НачалоПериода, ПланыНачалоПериода");
	КонтрольЛимитовФормы.ДобавитьЗависимостьПолей(ЭтаФорма, "ЕдиныйЦФО", "ЦФО, ПланыЦФО");  
	КонтрольЛимитовФормы.ДобавитьЗависимостьПолей(ЭтаФорма, "ЕдиныйПроект", "Проект, ПланыПроект");
	КонтрольЛимитовФормы.ДобавитьЗависимостьПолей(ЭтаФорма, "ЕдинаяВалюта", "Валюта, ПланыВалюта"); 
	КонтрольЛимитовФормы.ДобавитьЗависимостьПолей(ЭтаФорма, "ЕдиныйПриходРасход", "ПриходРасход, ПланыПриходРасход");
		
	КонтрольЛимитовФормы.ОпределитьЕдиныеРеквизитыФормыКорректировкиЛимитов(ЭтаФорма, "Планы");
	
	КонтрольЛимитовФормыКлиентСервер.НастроитьЗависимыеЭлементыФормы(ЭтаФорма); 
	
	ОбновитьПредставлениеПериодовПланирования();  
	
	// Контроль документа	
	КонтрольУХ.ПодготовитьФормунаСервере(ЭтотОбъект, Элементы.Страницы);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	УказаноОснование = ЗначениеЗаполнено(Объект.ДокументОснование);

	Элементы.ЗаполнитьПоОснованию.Видимость = УказаноОснование;  
	
	Элементы.Планы.КоманднаяПанель.ПодчиненныеЭлементы.ПланыДобавить.Видимость     = Не УказаноОснование;   
	Элементы.Планы.КоманднаяПанель.ПодчиненныеЭлементы.ПланыСкопировать.Видимость  = Не УказаноОснование;   
	
	Элементы.Планы.КонтекстноеМеню.ПодчиненныеЭлементы.ПланыКонтекстноеМенюДобавить.Видимость 	 = Не УказаноОснование;   
	Элементы.Планы.КонтекстноеМеню.ПодчиненныеЭлементы.ПланыКонтекстноеМенюСкопировать.Видимость = Не УказаноОснование;   
	
	Элементы.ПланыСумма.ТолькоПросмотр = УказаноОснование;
	Элементы.ПланыСуммаРезерв.ТолькоПросмотр = УказаноОснование; 
	Элементы.ПланыСтатьяБюджета.ТолькоПросмотр = УказаноОснование; 
	
	Элементы.ГруппаЗаполнениеТаблицы.ТолькоПросмотр = УказаноОснование;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСпособаОпределенияВалютыЛимитирования()
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДокументуПланированияНаСервере()
	
	Если Объект.Проведен Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
	КонецЕсли; 
	
	Модифицированность = Истина;
	
	Документы.ЗаявкаНаКорректировкуПланов.ЗаполнитьПоДокументуПланирования(Объект, Объект.ДокументОснование, Объект);
	АналитикиСтатейБюджетовУХ.ЗаполнитьРеквизитыАналитикВсехСтатей(ЭтотОбъект); 
	ОбновитьПредставлениеПериодовПланирования();    
	
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = ТекущаяДатаСеанса();
	КонецЕсли;

	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПланыАналитикаПриИзменении(Элемент)
	
	АналитикиСтатейБюджетовУХКлиент.ПриИзмененииАналитикиСтатьиБюджета(ЭтотОбъект, Элемент.Имя);
	СтрокаТабличнойЧасти = Элементы.Планы.ТекущиеДанные;
	ОбновитьСвободныйОстаток(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеПериодовПланирования()

	Периодичность = ПолучитьПериодичностьПланирования(Объект.ВидБюджета, НачалоПериода);   
	
	ПредставлениеПериода = ОбщегоНазначенияОПККлиентСервер.ПредставлениеПериодаПоПериодичности(
		НачалоПериода, Периодичность);  
		
	Для Каждого Строка Из Объект.Планы Цикл  
		Строка.Периодичность = ПолучитьПериодичностьПланирования(Объект.ВидБюджета, Строка.НачалоПериода);
		Строка.ПредставлениеПериода = ОбщегоНазначенияОПККлиентСервер.ПредставлениеПериодаПоПериодичности(
			Строка.НачалоПериода, Строка.Периодичность);
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПредставлениеПериодаСтроки(Строка, ВидБюджета)
	
	Строка.Периодичность = ПолучитьПериодичностьПланирования(ВидБюджета, Строка.НачалоПериода);

	Строка.ПредставлениеПериода = ОбщегоНазначенияОПККлиентСервер.ПредставлениеПериодаПоПериодичности(
		Строка.НачалоПериода, Строка.Периодичность);    
	
КонецПроцедуры  
	
&НаСервереБезКонтекста
Функция ПолучитьПериодичностьПланирования(ВидБюджета, НачалоПериода)
	
	ПараметрыПланирования = ОперативноеПланированиеПовтИспУХ.ПолучитьПараметрыОперПланирования(ВидБюджета, НачалоПериода);
	
	Возврат ПараметрыПланирования.ПериодичностьЛимитирования;   
	
КонецФункции

#Область ПереопределяемыеСобытияЭлементовДляКонтроляДокумента

&НаКлиенте
Процедура ПриОжиданииВыполнитьКонтрольДокумента()
	ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьКонтрольДокумента", 0.5, Истина);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКонтрольДокумента()
	КонтрольУХКлиентСервер.ВыполнитьИнтерактивныйКонтроль(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТаблицаКонтроляДокументаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТД =  Элемент.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	КонтрольУХКлиент.ПоказатьРасшифровкуКонтроля(Объект, ТД);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТаблицаКонтроляДокументаПриАктивизацииЯчейки(Элемент)
	Элемент.ТекущаяСтрока = Неопределено;
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОбновитьСвободныйОстаток(СтрокаТабличнойЧасти)   
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НачалоПериода", СтрокаТабличнойЧасти.НачалоПериода);
	СтруктураПараметров.Вставить("Периодичность", СтрокаТабличнойЧасти.Периодичность);
	СтруктураПараметров.Вставить("ЦФО", СтрокаТабличнойЧасти.ЦФО);
	СтруктураПараметров.Вставить("Проект", СтрокаТабличнойЧасти.Проект);
	СтруктураПараметров.Вставить("СтатьяБюджета", СтрокаТабличнойЧасти.СтатьяБюджета);
	СтруктураПараметров.Вставить("Аналитика1", СтрокаТабличнойЧасти.Аналитика1);  
	СтруктураПараметров.Вставить("Аналитика2", СтрокаТабличнойЧасти.Аналитика2);
	СтруктураПараметров.Вставить("Аналитика3", СтрокаТабличнойЧасти.Аналитика3);
	СтруктураПараметров.Вставить("Аналитика4", СтрокаТабличнойЧасти.Аналитика4);
	СтруктураПараметров.Вставить("Аналитика5", СтрокаТабличнойЧасти.Аналитика5);
	СтруктураПараметров.Вставить("Аналитика6", СтрокаТабличнойЧасти.Аналитика6);    
	СтруктураПараметров.Вставить("Валюта", СтрокаТабличнойЧасти.Валюта);
	СтруктураПараметров.Вставить("ВидБюджета", Объект.ВидБюджета);
	
	СтрокаТабличнойЧасти.Свободно = КонтрольЛимитовФормыВызовСервера.ЗаполнитьОстаткиСвободногоЛимитаПоСтрокеКорректировкаЛимитов(СтруктураПараметров);
	
КонецПроцедуры	

#Область ЕдиныеРеквизиты 

&НаКлиенте
Процедура ПриИзмененииЕдиногоРеквизита(ИмяЕдиногоРеквизита)
	
	КонтрольЛимитовФормыКлиент.ПриИзмененииЕдиногоРеквизита(ЭтаФорма, ИмяЕдиногоРеквизита, "Планы"); 
	
	Для Каждого Строка Из Объект.Планы Цикл
		ОбновитьСвободныйОстаток(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОграничениеТипаДокументаОснования()
	
	Элементы.ДокументОснование.ОграничениеТипа	= КонтрольЛимитовУХ.ТипыДокументаОснованияКорректировкиЛимитов();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
